OFtutorial8_customBC/testCase/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield          | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration      | Version:  3.0.0                                 |
|   \  /    A nd            | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation   |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;
interpolationScheme cellPoint;

fields
(
	p
	U
	k
	omega
	wallGradU
	wallShearStress
);

sets
(
wallSampling
{
	type patchCloud;
	axis xyz;
	maxDistance 0.0002625;
	patches
	(
		pipe
	);
	points
	(
		(0.000000e+00 2.585120e-02 4.558265e-03)
		(6.824700e-03 2.585120e-02 4.558265e-03)
		(1.364940e-02 2.585120e-02 4.558265e-03)
		(2.047410e-02 2.585120e-02 4.558265e-03)
		(2.729880e-02 2.585120e-02 4.558265e-03)
		(3.412350e-02 2.585120e-02 4.558265e-03)
		(4.094820e-02 2.585120e-02 4.558265e-03)
		(4.777290e-02 2.585120e-02 4.558265e-03)
		(5.459760e-02 2.585120e-02 4.558265e-03)
		(6.142230e-02 2.585120e-02 4.558265e-03)
		(6.824700e-02 2.585120e-02 4.558265e-03)
		(7.507170e-02 2.585120e-02 4.558265e-03)
		(8.189640e-02 2.585120e-02 4.558265e-03)
		(8.872110e-02 2.585120e-02 4.558265e-03)
		(9.554580e-02 2.585120e-02 4.558265e-03)
		(1.023705e-01 2.585120e-02 4.558265e-03)
		(1.091952e-01 2.585120e-02 4.558265e-03)
		(1.160199e-01 2.585120e-02 4.558265e-03)
		(1.228446e-01 2.585120e-02 4.558265e-03)
		(1.296693e-01 2.585120e-02 4.558265e-03)
		(1.364940e-01 2.585120e-02 4.558265e-03)
		(1.433187e-01 2.585120e-02 4.558265e-03)
		(1.501434e-01 2.585120e-02 4.558265e-03)
		(1.569681e-01 2.585120e-02 4.558265e-03)
		(1.637928e-01 2.585120e-02 4.558265e-03)
		(1.706175e-01 2.585120e-02 4.558265e-03)
		(1.774422e-01 2.585120e-02 4.558265e-03)
		(1.842669e-01 2.585120e-02 4.558265e-03)
		(1.910916e-01 2.585120e-02 4.558265e-03)
		(1.979163e-01 2.585120e-02 4.558265e-03)
		(2.047410e-01 2.585120e-02 4.558265e-03)
		(2.115657e-01 2.585120e-02 4.558265e-03)
		(2.183904e-01 2.585120e-02 4.558265e-03)
		(2.252151e-01 2.585120e-02 4.558265e-03)
		(2.320398e-01 2.585120e-02 4.558265e-03)
		(2.388645e-01 2.585120e-02 4.558265e-03)
		(2.456892e-01 2.585120e-02 4.558265e-03)
		(2.525139e-01 2.585120e-02 4.558265e-03)
		(2.593386e-01 2.585120e-02 4.558265e-03)
		(2.661633e-01 2.585120e-02 4.558265e-03)
		(2.729880e-01 2.585120e-02 4.558265e-03)
		(2.798127e-01 2.585120e-02 4.558265e-03)
		(2.866374e-01 2.585120e-02 4.558265e-03)
		(2.934621e-01 2.585120e-02 4.558265e-03)
		(3.002868e-01 2.585120e-02 4.558265e-03)
		(3.071115e-01 2.585120e-02 4.558265e-03)
		(3.139362e-01 2.585120e-02 4.558265e-03)
		(3.207609e-01 2.585120e-02 4.558265e-03)
		(3.275856e-01 2.585120e-02 4.558265e-03)
		(3.344103e-01 2.585120e-02 4.558265e-03)
		(3.412350e-01 2.585120e-02 4.558265e-03)
		(3.480597e-01 2.585120e-02 4.558265e-03)
		(3.548844e-01 2.585120e-02 4.558265e-03)
		(3.617091e-01 2.585120e-02 4.558265e-03)
		(3.685338e-01 2.585120e-02 4.558265e-03)
		(3.753585e-01 2.585120e-02 4.558265e-03)
		(3.821832e-01 2.585120e-02 4.558265e-03)
		(3.890079e-01 2.585120e-02 4.558265e-03)
		(3.958326e-01 2.585120e-02 4.558265e-03)
		(4.026573e-01 2.585120e-02 4.558265e-03)
		(4.094820e-01 2.585120e-02 4.558265e-03)
		(4.163067e-01 2.585120e-02 4.558265e-03)
		(4.231314e-01 2.585120e-02 4.558265e-03)
		(4.299561e-01 2.585120e-02 4.558265e-03)
		(4.367808e-01 2.585120e-02 4.558265e-03)
		(4.436055e-01 2.585120e-02 4.558265e-03)
		(4.504302e-01 2.585120e-02 4.558265e-03)
		(4.572549e-01 2.585120e-02 4.558265e-03)
		(4.640796e-01 2.585120e-02 4.558265e-03)
		(4.709043e-01 2.585120e-02 4.558265e-03)
		(4.777290e-01 2.585120e-02 4.558265e-03)
		(4.845537e-01 2.585120e-02 4.558265e-03)
		(4.913784e-01 2.585120e-02 4.558265e-03)
		(4.982031e-01 2.585120e-02 4.558265e-03)
		(5.050278e-01 2.585120e-02 4.558265e-03)
		(5.118525e-01 2.585120e-02 4.558265e-03)
		(5.186772e-01 2.585120e-02 4.558265e-03)
		(5.255019e-01 2.585120e-02 4.558265e-03)
		(5.323266e-01 2.585120e-02 4.558265e-03)
		(5.391513e-01 2.585120e-02 4.558265e-03)
		(5.459760e-01 2.585120e-02 4.558265e-03)
		(5.528007e-01 2.585120e-02 4.558265e-03)
		(5.596254e-01 2.585120e-02 4.558265e-03)
		(5.664501e-01 2.585120e-02 4.558265e-03)
		(5.732748e-01 2.585120e-02 4.558265e-03)
		(5.800995e-01 2.585120e-02 4.558265e-03)
		(5.869242e-01 2.585120e-02 4.558265e-03)
		(5.937489e-01 2.585120e-02 4.558265e-03)
		(6.005736e-01 2.585120e-02 4.558265e-03)
		(6.073983e-01 2.585120e-02 4.558265e-03)
		(6.142230e-01 2.585120e-02 4.558265e-03)
		(6.210477e-01 2.585120e-02 4.558265e-03)
		(6.278724e-01 2.585120e-02 4.558265e-03)
		(6.346971e-01 2.585120e-02 4.558265e-03)
		(6.415218e-01 2.585120e-02 4.558265e-03)
		(6.483465e-01 2.585120e-02 4.558265e-03)
		(6.551712e-01 2.585120e-02 4.558265e-03)
		(6.619959e-01 2.585120e-02 4.558265e-03)
		(6.688206e-01 2.585120e-02 4.558265e-03)
		(6.756453e-01 2.585120e-02 4.558265e-03)
		(6.824700e-01 2.585120e-02 4.558265e-03)
	);
}

centrelineSampling
{
	type midPoint;
	axis xyz;
	start (0.000000e+00 2.625000e-04 2.625000e-04);
	end (6.824700e-01 2.625000e-04 2.625000e-04);
}

rake_x_0.000
{
	type midPoint;
	axis xyz;
	start (0.000000e+00 -2.585120e-02 -4.558265e-03);
	end (0.000000e+00 2.585120e-02 4.558265e-03);
}

rake_x_0.057
{
	type midPoint;
	axis xyz;
	start (5.687250e-02 -2.585120e-02 -4.558265e-03);
	end (5.687250e-02 2.585120e-02 4.558265e-03);
}

rake_x_0.114
{
	type midPoint;
	axis xyz;
	start (1.137450e-01 -2.585120e-02 -4.558265e-03);
	end (1.137450e-01 2.585120e-02 4.558265e-03);
}

rake_x_0.171
{
	type midPoint;
	axis xyz;
	start (1.706175e-01 -2.585120e-02 -4.558265e-03);
	end (1.706175e-01 2.585120e-02 4.558265e-03);
}

rake_x_0.227
{
	type midPoint;
	axis xyz;
	start (2.274900e-01 -2.585120e-02 -4.558265e-03);
	end (2.274900e-01 2.585120e-02 4.558265e-03);
}

rake_x_0.284
{
	type midPoint;
	axis xyz;
	start (2.843625e-01 -2.585120e-02 -4.558265e-03);
	end (2.843625e-01 2.585120e-02 4.558265e-03);
}

rake_x_0.341
{
	type midPoint;
	axis xyz;
	start (3.412350e-01 -2.585120e-02 -4.558265e-03);
	end (3.412350e-01 2.585120e-02 4.558265e-03);
}

rake_x_0.398
{
	type midPoint;
	axis xyz;
	start (3.981075e-01 -2.585120e-02 -4.558265e-03);
	end (3.981075e-01 2.585120e-02 4.558265e-03);
}

rake_x_0.455
{
	type midPoint;
	axis xyz;
	start (4.549800e-01 -2.585120e-02 -4.558265e-03);
	end (4.549800e-01 2.585120e-02 4.558265e-03);
}

rake_x_0.512
{
	type midPoint;
	axis xyz;
	start (5.118525e-01 -2.585120e-02 -4.558265e-03);
	end (5.118525e-01 2.585120e-02 4.558265e-03);
}

rake_x_0.569
{
	type midPoint;
	axis xyz;
	start (5.687250e-01 -2.585120e-02 -4.558265e-03);
	end (5.687250e-01 2.585120e-02 4.558265e-03);
}

rake_x_0.626
{
	type midPoint;
	axis xyz;
	start (6.255975e-01 -2.585120e-02 -4.558265e-03);
	end (6.255975e-01 2.585120e-02 4.558265e-03);
}

rake_x_0.682
{
	type midPoint;
	axis xyz;
	start (6.824700e-01 -2.585120e-02 -4.558265e-03);
	end (6.824700e-01 2.585120e-02 4.558265e-03);
}

);
